package com.sist.main;
/*
 *   상속 / 오버라이딩 / 형변환
 *                   자동 형변환 / 강제 형변환
 *                   ** 자바 라이브러리 클래스 리턴 => Object 
 *   ** 클래스는 크기 비교
 *      ------------- 상속관계 / 포함관계
 *                    ------
 *                    논리적 => 상속 내리는 클래스 > 상속 받는 클래스
 *                    포함하고 있는 클래스가 크다
 *                    
 *   - 상속
 *      정의 : 이미 만들어진 클래스의 변수/메소드를 받아서 새로운 클래스를 만들어서 사용
 *                       --------------
 *                       예외) static / 생성자 / 초기화 블록 -> 상속 불가
 *                       ** private은 상속은 되는데 접근은 불가능
 *                          => getter/setter 사용하며 접근 가능
 *      1) 문법
 *      2) 형식
 *      3) 특징
 *      4) 메소드 재정의(오버라이딩)
 *      5) 형변환
 *         
 */
public class 정리_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
