/*
 *  4p   : 실행과정
 *  5p   : 자바의 장점
 *  14p  : 바이트코드(.java => javac => .class)
 *                                  ------ 바이트코드
 *                         동일한 코드 => 운영체제 호환성 좋다
 *                         =배포
 *  28p  : main()설명
 *  29p  : 주석
 *  30p  : 세미콜론
 *  36p  : 변수의 개념
 *  41p  : 정수, 정수 타입
 *  43p  : 정수 표현법
 *  45p  : 문자 타입 '한개문자'
 *  47p  : 실수(float, double)
 *  50p  : 논리(boolean) 
 *  51p  : 문자열 : String => 참조 : 52p 특수문자 참조
 *  55p  : 자동형변환('='왼쪽이 크면 자동으로 타입변환)
 *  57p  : 강제형변환('='왼쪽이 작으면 오른쪽 타입으로 강제변환)
 *  66p  : String을 각 데이터형으로 변경
 *  72p  : Scanner : 키보드로 데이터 입력
 *  ---------------------------------------------------
 *  81p  : 증감식
 *  83p  : 산술 연산자(+, -, *, /, %)
 *  90p  : 비교 연산자(==, !=, <, >, <=, >=)
 *  93p  : 논리 연산자(&&, ||, ^)
 *  104p : 대입연산자
 *  105p : 삼항연산자((조건)? 값:값) 
 */
public class 정리_5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
