/*
 *   2차 for
 *   ------
 *   
 *   형식)
 *      for() -> 줄수 : rows 가로
 *      {
 *      	for() -> 화면 출력 : cols 세로
 *      	{
 *      
 *      	}	
 *      }
 *      1차 5번, 2차 4번
 *      1111
 *      1111
 *      1111
 *      1111
 *      1111
 *      
 *      *
 *      **
 *      ***
 *      ****
 *  ----------------
 *     i   j
 *     줄수 별표
 *     1    1
 *     2    2
 *     3    3
 *     4    4 => i==j => j는 i만큼
 *      ****
 *      ***
 *      **
 *      *
 *      1   4
 *      2   3
 *      3   2
 *      4   1  역순이면 + => i+j=5 => j=5-i
 *      
 *      
 *         *
 *        **
 *       ***
 *      ****
 *    ----------
 *              i    j     k
 *             줄수   공백   별표
 *             1     3     1
 *             2     2     2
 *             3     1     3
 *             4     0     4
 *             
 *             i+j=4 => j=4-i 별표 k=i
 *      
 *      
 *      ****
 *       ***
 *        **
 *         *
 *         
 *         줄수  공백  별표
 *         1    0    4
 *         2    1    3
 *         3    2    2
 *         4    3    1
 *         
 *         i=j+1  j=i-1  i+k=5 => k=5-i
 *  --------------
 *         *
 *        ***
 *       *****
 *      *******
 *       *****
 *        ***
 *         *
 *         
 *         줄 공백 별
 *         1     1
 *         2     3
 *         3     5
 *         4     7
 *         5     5
 *         6     3
 *         7     1
 * ------------------
 *         *****
 *          ***
 *           *
 *          ***
 *         *****
 * ------------------
 *         *   *
 *         ** **
 *         *****
 *         ** **
 *         *   *
 *         6줄
 */
public class 제어문_4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		for(int i=1;i<=4;i++)
		{
			for(int j=1;j<=i-1;j++)
			{
				System.out.print(" ");
			}
			for(int k=1;k<=5-i;k++)
			{
				System.out.print("*");
			}
			System.out.println();
		}
		
		
	}

}
